package com.company;
///////////////////////////////////////////////////////////////
//              Алдамжаров А.Х.     ВТ-16-2                  //
///////////////////////////////////////////////////////////////


import java.util.Random;

public class Main {

    public static void main(String[] args) {

        /////////////////////////////////////////////////////////////////////////////////////////////////////
	    //Задание 1                                                                                        //
        //Даны числа от 1 до 1000 и число m. Вывести результат деления квадрата сотен кратных 5 на число m.//
        /////////////////////////////////////////////////////////////////////////////////////////////////////

        double m=2;
        for(double i=1;i<=1000;i++) {
            if ((i / 100) % 5 == 0) {
                System.out.print("("+(i / 100)+"^2)/"+m+"=");
                System.out.println((i / 100)*(i / 100)/ m);
            }
        }


        System.out.println("\n\n\n\n");
        /////////////////////////////////////////////////////////////////////////////////////////////////////
        //Задание 2                                                                                        //
        //Ввести массив, состоящий из 9 элементов (девять двузначных чисел)целого типа.                    //
        //Получить новый массив, состоящий из сумм цифр элементов исходного массива.                       //
        /////////////////////////////////////////////////////////////////////////////////////////////////////

        int [] a=new int[9];
        int [] b=new int[9];
        Random rnd=new Random();
        System.out.print("\n Массив A: ");
        for(int i=0;i<9;i++){
            a[i]=rnd.nextInt(89)+10;
            System.out.print(a[i]+"\t");
        }
        System.out.print("\n Массив B: ");
        for(int i=0;i<9;i++){
            b[i]=(a[i]/10)+(a[i]%10);
            System.out.print(b[i]+"\t");
        }


    }
}
